Repository: vdelachaux/4DPop-XLIFF-Pro
Catalog: Resources/*.lproj/Xliff Editor.xlf
Languages: fr

# SaveButton
source: Save
fr: Enregistrer

# YesButton
source: Yes
fr: Oui

# NoButton
source: No
fr: Non

# NewButton
source: New
fr: Nouveau

# EditionButton
source: Edition
fr: Édition

# ChangeButton
source: Change…
fr: Changer…

source: Make IDs unique
fr: Rendre les ID uniques

source: File name:
fr: Nom du fichier :

# DeleteGroup
source: Are you sure that you want to delete the group "{item}" ?
fr: Êtes-vous certain de vouloir supprimer le groupe "{item}" ?

# DeleteItem
source: Are you sure that you want to delete the item "{item}" ?
fr: Êtes-vous certain de vouloir supprimer la ligne "{item}" ?

source: Are you sure?
fr: Etes-vous certain ?

# DeleteFile
source: Are you sure that you want to delete the file "{filename}"?
fr: Êtes-vous certain de vouloir supprimer le fichier "{filename}" ?

# theNameIsAlreadyTaken
source: The name "{name}" is already taken. Please choose a different name.
fr: Le nom "{name}" est déjà utilisé. Veuillez choisir un nom différent.

# theNameMustNotBeEmpty
source: The name must not be empty. Please enter a valid name.
fr: Le nom ne doit pas être vide. Veuillez entrer un nom valide.

source: Select the xliff file to import
fr: Sélectionnez le fichier xliff à importer

source: Modifications are not allowed because the IDs are not unique
fr: Les modifications ne sont pas autorisées car les ID ne sont pas uniques

# theFileAlreadyExists
source: The file {name} already exists. Do you want to replace it?
fr: Le fichier {name} existe déjà. Voulez-vous le remplacer ?

# makingTheIdsUniqueWillPreventTheOldCommand
source: Making the IDs unique will prevent the old command "{command}" from being used. Changes will be saved and cannot be undone.
fr: Le fait de rendre les identifiants uniques empêchera l'utilisation de l'ancienne commande "{command}". Les modifications seront enregistrées et ne pourront pas être annulées.

source: I have understood well
fr: J'ai bien compris

source: Unique IDs assignment failure
fr: Échec de l'attribution d'IDs uniques

# TipAddFile
source: New file
fr: Nouveau fichier

# TipNewGroup
source: Add a group in the current file
fr: Ajouter un groupe au fichier courant

# TipNewTransUnit
source: Add a string to the current group
fr: Ajouter une chaine dans le groupe courant

# TipInfo
source: Current file's info
fr: Informations sur le fichier courant

# TipPreferences
source: Preferences
fr: Préférences

# TipToggleWindow
source: Switch between the editor and the pallet
fr: Bascule entre l'éditeur et la palette

# TipString
source: Show or Hide the string box
fr: Afficher ou masquer la chaîne

# TipsShowOrHideTheAttributesBox
source: Show or Hide the attributes box
fr: Afficher ou masquer la fenêtres des attributs

# Tips_XLIFF10Specification
source: XLIFF 1.0 Specification
fr: Spécification XLIFF 1.0 (Anglais)

# Tips_ShortCuts
source: Short cuts for the current actions.
fr: Raccourcis pour les actions courantes.

# ToolTip
source: A multilingual XLIFF editor
fr: Un éditeur XLIFF multilingue

# NewItem
source: String
fr: Chaîne

source: New File
fr: Nouveau fichier

# MenuNew
source: New
fr: Nouveau

# Menuxliff
source: File...
fr: Fichier...

# Menus_FillIn
source: Fill in
fr: Compléter

# Menus_Preferences…
source: Preferences…
fr: Préférences…

# Menus_Rename
source: Rename…
fr: Renommer…

source: Delete.…
fr: Supprimer…

source: File informations…
fr: Informations fichier…

# Menus_AddAgroup
source: Add a group
fr: Ajouter un groupe

source: Show on disk
fr: Montrer le fichier

# Menus_ValidateUsingDTD
source: Validate using the DTD
fr: Valider à l'aide de la DTD

# Menu_Editor
source: Editor…
fr: Éditeur…

source: Set reference value to all languages
fr: Définir la valeur de référence pour toutes les langues

source: Prefix with the group name
fr: Préfixer avec le nom du groupe

# addComment
source: Add a comment
fr: Ajouter un commentaire

source: Edit comment
fr: Modifier le commentaire

source: Close comment
fr: Fermer le commentaire

source: All
fr: Tous

source: Operating Systems
fr: Systèmes d'exploitation

source: Project Settings…
fr: Paramètres du projet…

source: Import…
fr: Importer…

# copyAsXliffReference
source: XLIFF reference
fr: Référence XLIFF

# copyTheCode
source: 4D Code
fr: Code 4D

source: New Group
fr: Nouveau groupe

source: New String
fr: Nouvelle Chaîne

source: Duplicate
fr: Dupliquer

source: Close
fr: Fermer

source: Code for
fr: Code pour

source: Window
fr: Fenêtre

source: Find
fr: Chercher

source: Find next
fr: Chercher suivant

# WindowEditor
source: Xliff Editor
fr: Editeur Xliff

# searchlabel
source: Find...
fr: Chercher...

source: Don't save
fr: Ne pas enregistrer

source: Resources Folder
fr: Dossier ressources

source: Default values
fr: Valeurs par défaut

source: Use the database's folder
fr: Utiliser le dossier de la base

source: Use the folder:
fr: Utiliser le dossier :

source: Comments
fr: Commentaires

source: Metal Window
fr: Aspect métal

source: Languages
fr: Langues

source: General
fr: Générale

source: Database
fr: Base

source: Attributes
fr: Attributs

source: Values
fr: Valeurs

source: Select the Target Resource Folder.
fr: Sélectionner le dossier ressource à éditer

source: Use group's resname
fr: Utiliser le resname du groupe

source: Use prefix:
fr: Utiliser le préfixe :

source: Separating character:
fr: Caractère séparateur :

source: Escaped characters
fr: Caractères échappés

source: Maximum size of the resname
fr: Taille maxi du resname

source: Advanced
fr: Avançé

# Labels_Files
source: Files
fr: Fichiers

# DragAndDropInForm
source: Drag & drop in form:
fr: Glissé-déposé dans un formulaire :

source: Styled text
fr: Texte stylé

source: Localization
fr: Localisation

# projectPath
source: Project
fr: Projet

# projectLanguages
source: Languages
fr: Langues

source: Reference
fr: Référence

source: Localizations
fr: Localisations

source: Filter
fr: Filtrer

source: File
fr: Fichier

# thisIsTheFirstTime
source: This is the first time you've opened the XLIFF editor for this project, or perhaps you've changed the target languages, so let's have a look...
fr: C'est la première fois que vous ouvrez l'éditeur XLIFF pour ce projet, ou peut-être avez-vous changé les langues cibles, alors jetons un coup d'œil...

# wizardComment
source: The XLIFF standard requires us to determine a source language in which all strings are written. This language will be the reference language, from which all translations will be made. The other languages are referred to as target languages, and will be used for dialogues, warnings, printouts and so on. This is the language that will be used for the end user, according to your choice. Depending on the content of your project, the language of the system and the application, I've tried to determine the source and target languages. You can change the source language and add target languages if you wish.
fr: La norme XLIFF oblige à déterminer une langue source dans laquelle toutes les chaînes sont écrites. Cette langue sera la langue de référence, à partir de laquelle toutes les traductions seront effectuées. Les autres langues sont appelées langues cibles et seront utilisées pour les dialogues, les avertissements, les impressions, etc. C'est la langue qui sera utilisée pour l'utilisateur final, selon votre choix. En fonction du contenu de votre projet, de la langue du système et de l'application, j'ai essayé de déterminer la langue source et les langues cibles. Vous pouvez modifier la langue source et ajouter des langues cibles si vous le souhaitez.

# wizardTitle
source: Welcome to 4DPop XLIFF Pro
fr: Bienvenue dans 4DPop XLIFF Pro

source: LANGUAGES FOUND
fr: LANGUES TROUVÉES

source: AVAILABLE LANGUAGES
fr: Le contenu du dossier {lang} sera supprimé

# theFolderWillBeDeleted
source: The "{lang}" folder and its contents will be deleted.
fr: Le dossier "{lang}" et son contenu seront supprimés.

# String 1
source: Remove
fr: Supprimer
